Repository: TableProApp/TablePro
Catalog: TablePro/Resources/Localizable.xcstrings
Source language: en
Languages: fr, ko, tr, vi, zh_hans, zh_hant

source: The SSH server connects to this socket instead of Host and Port. A database on a socket cannot negotiate TLS, so TablePro turns it off; the SSH tunnel still encrypts the whole path.
fr: Le serveur SSH se connecte à ce socket au lieu d'Host et de Port. Une base de données sur un socket ne peut pas négocier TLS, donc TablePro l'éteint ; le tunnel SSH cryptage toujours l'ensemble du chemin.
ko: SSH 서버는 호스트 및 포트 대신 이 소켓에 연결합니다. 소켓의 데이터베이스는 TLS를 협상할 수 없으므로 TablePro에서 TLS를 끕니다. 단, SSH 터널은 전체 경로를 계속 암호화합니다.
tr: SSH sunucusu, Sunucu ve Port yerine bu sokete bağlanır. Soket üzerindeki bir veritabanı TLS anlaşması yapamaz, bu yüzden TablePro TLS'i kapatır; SSH tüneli yine de tüm yolu şifreler.
vi: Máy chủ SSH kết nối tới socket này thay vì Máy chủ và Cổng. Cơ sở dữ liệu trên socket không thể thương lượng TLS, nên TablePro tắt TLS; đường hầm SSH vẫn mã hóa toàn bộ đường truyền.
zh_hans: SSH 服务器会连接到此 socket，而不是主机和端口。socket 上的数据库无法协商 TLS，因此 TablePro 会关闭 TLS；SSH 隧道仍然加密整条链路。
zh_hant: SSH 伺服器會連線到此 socket，而不是主機與連接埠。socket 上的資料庫無法協商 TLS，因此 TablePro 會關閉 TLS；SSH 通道仍會加密整條路徑。

source: This is not a value the list editor can read back.
fr: Ce n'est pas une valeur que l'éditeur de liste peut lire à nouveau.
ko: 목록 편집기에서 다시 읽을 수 있는 값이 아닙니다.
tr: Bu, liste düzenleyicisinin geri okuyabileceği bir değer değil.
vi: Đây không phải giá trị mà trình sửa danh sách đọc lại được.
zh_hans: 这不是列表编辑器能读回的值。
zh_hant: 這不是列表編輯器能讀回的值。

source: Read & Write
fr: Lire et écrire
ko: 읽기 및 쓰기
tr: Okuma & Yazma
vi: Đọc & ghi
zh_hans: 读写
zh_hant: 讀寫

source: Execute all statements in a single transaction. If any statement fails, all changes are rolled back.
fr: Exécutez toutes les déclarations dans une seule transaction. Si une déclaration échoue, toutes les modifications sont annulées.
ko: 모든 문을 단일 트랜잭션에서 실행합니다. 문 하나라도 실패하면 모든 변경 사항이 롤백됩니다.
tr: Tüm ifadeleri tek bir işlemde çalıştır. Herhangi bir ifade başarısız olursa tüm değişiklikler geri alınır.
vi: Thực thi tất cả câu lệnh trong một giao dịch. Nếu bất kỳ câu lệnh nào thất bại, tất cả thay đổi sẽ được hoàn tác.
zh_hans: 在单个事务中执行所有语句。如果任一语句失败，所有更改将回滚。
zh_hant: 在單一交易中執行所有陳述式。若任一陳述式失敗，所有變更都會回復。

source: MongoDB query language. Use to import into MongoDB.
fr: Langage de requête MongoDB. Utilisez-le pour importer dans MongoDB.
ko: MongoDB 쿼리 언어입니다. MongoDB로 가져올 때 사용합니다.
tr: MongoDB sorgu dili. MongoDB'ye içe aktarmak için kullanın.
vi: Ngôn ngữ truy vấn MongoDB. Dùng để nhập vào MongoDB.
zh_hans: MongoDB 查询语言。用于导入到 MongoDB。
zh_hant: MongoDB 查詢語言。用於匯入 MongoDB。

source: Opens the TablePro pricing page
fr: Ouvre la page de tarification de TablePro
ko: TablePro 가격 페이지를 엽니다
tr: TablePro fiyatlandırma sayfasını açar
vi: Mở trang giá của TablePro
zh_hans: 打开 TablePro 价格页面
zh_hant: 開啟 TablePro 價格頁面

source: Connection UUID
fr: UUID de connexion
ko: 연결 UUID
tr: Bağlantı UUID'si
vi: UUID kết nối
zh_hans: 连接 UUID
zh_hant: 連線 UUID

source: Delete Column
fr: Supprimer la colonne
ko: 열 삭제
tr: Sütunu Sil
vi: Xóa cột
zh_hans: 删除列
zh_hant: 刪除欄位

source: Publish
fr: Publier
ko: 게시
tr: Yayınla
vi: Xuất bản
zh_hans: 发布
zh_hant: 發佈

source: ~/.pgpass found — matching entry exists
fr: ~/.pgpass trouvé - entrée correspondante existe
ko: ~/.pgpass 발견 — 일치하는 항목 있음
tr: ~/.pgpass bulundu — eşleşen giriş var
vi: Tìm thấy ~/.pgpass — có entry khớp
zh_hans: ~/.pgpass 已找到 - 存在匹配条目
zh_hant: 已找到 ~/.pgpass，存在相符的項目

source: Find this on the instance's overview page in the Google Cloud console.
fr: Trouvez-le sur la page d'aperçu de l'instance dans la console Google Cloud.
ko: Google Cloud 콘솔에서 인스턴스의 개요 페이지를 열어 확인하십시오.
tr: Bunu Google Cloud konsolunda örneğin genel bakış sayfasında bulabilirsiniz.
vi: Bạn tìm thấy giá trị này ở trang tổng quan của instance trong Google Cloud console.
zh_hans: 可在 Google Cloud 控制台中该实例的概览页面找到。
zh_hant: 可在 Google Cloud 主控台中該執行個體的總覽頁面找到。

source: Could Not Open Sample
fr: Impossible d'ouvrir l'échantillon
ko: 샘플을 열 수 없음
tr: Örnek açılamadı
vi: Không thể mở Mẫu
zh_hans: 无法打开示例
zh_hant: 無法開啟範例

source: Use the same filter for the target
fr: Utilisez le même filtre pour la cible.

source: This JSON document is too large for tree view. Use text mode instead.
fr: Ce document JSON est trop volumineux pour la vue en arbre. Utilisez plutôt le mode texte.
ko: 이 JSON 문서는 트리 보기로 표시하기에 너무 큽니다. 대신 텍스트 모드를 사용하십시오.
tr: Bu JSON belgesi ağaç görünümü için çok büyük. Bunun yerine metin modunu kullanın.
vi: Tài liệu JSON này quá lớn cho chế độ cây. Hãy dùng chế độ văn bản.
zh_hans: 此 JSON 文档对于树形视图过大，请使用文本模式。
zh_hant: 此 JSON 文件對樹狀檢視而言過大。請改用文字模式。

source: Choose Type
fr: Choisissez le type
ko: 유형 선택
tr: Tür Seç
vi: Chọn kiểu
zh_hans: 选择类型
zh_hant: 選擇類型

source: Tables of %@
fr: Tables de %@
ko: %@의 테이블
tr: %@ tabloları
vi: Bảng của %@
zh_hans: %@ 的表
zh_hant: %@ 的資料表

source: Loading %@…
fr: Chargement %@...
ko: %@ 불러오는 중…
tr: %@ yükleniyor…
vi: Đang tải %@…
zh_hans: 正在加载 %@…
zh_hant: 正在載入 %@…

source: Filters combined with 'logic'
fr: Filtres combinés à la « logique »
ko: 'logic'으로 결합된 필터
tr: 'logic' ile birleştirilen filtreler
vi: Các bộ lọc được kết hợp bằng 'logic'
zh_hans: 用 'logic' 组合的筛选条件
zh_hant: 用 'logic' 組合的篩選條件

source: Add Extension
fr: Ajouter une extension

source: When tabs stop fitting:
fr: Lorsque les onglets cessent de s'adapter :

source: The file holds one object, not a list of rows. Open a JSON array of objects or a JSON Lines file.
fr: Le fichier contient un seul objet, pas une liste de lignes. Ouvrez un tableau JSON d'objets ou un fichier JSON Lines.

source: Value kind differs
fr: Le type de valeur diffère
ko: 값 종류가 다름
tr: Değer türü farklı
vi: Loại giá trị khác nhau
zh_hans: 值的种类不同
zh_hant: 值的種類不同

source: This plugin is not in the registry, so it can't be updated automatically.
fr: Ce plugin n'est pas dans le registre, il ne peut donc pas être mis à jour automatiquement.
ko: 이 플러그인은 레지스트리에 없으므로 자동으로 업데이트할 수 없습니다.
tr: Bu eklenti depoda bulunmadığından otomatik olarak güncellenemez.
vi: Plugin này không có trong registry nên không thể cập nhật tự động.
zh_hans: 此插件不在注册表中，无法自动更新。
zh_hant: 此外掛不在外掛註冊中，因此無法自動更新。

source: AI access is turned off for this connection.
fr: L'accès à l'IA est désactivé pour cette connexion.

source: Field
fr: Champ
ko: 필드
tr: Alan
vi: Trường
zh_hans: 字段
zh_hant: 欄位

source: Enable Plugin
fr: Activer le plugin

source: Can't Show This Result
fr: Impossible de montrer ce résultat

source: Cell Renderer
fr: Réalisateur de cellules
ko: 셀 렌더러
tr: Hücre Oluşturucu
vi: Trình hiển thị ô
zh_hans: 单元格渲染器
zh_hant: 儲存格繪製器

source: Plan Not Saved
fr: Plan non sauvegardé
ko: 플랜이 저장되지 않음
tr: Plan Kaydedilmedi
vi: Kế hoạch chưa được lưu
zh_hans: 未保存计划
zh_hant: 未儲存計劃

source: No Object
fr: Pas d'objet
ko: 객체 없음
tr: Nesne Yok
vi: Không có đối tượng
zh_hans: 无对象
zh_hant: 無物件

source: This column needs a type.
fr: Cette colonne a besoin d'un type.

source: Escape closes Jump to Column
fr: Escape ferme Aller à la colonne

source: Select All
fr: Sélectionner tout
ko: 전체 선택
tr: Tümünü Seç
vi: Chọn tất cả
zh_hans: 全选
zh_hant: 全選

source: Compared %@. 1 difference.
fr: Comparé %@. 1 différence.

source: Filters last as long as the tab. Filters already saved are kept, not deleted.
fr: Les filtres durent aussi longtemps que la barre d'onglets. Les filtres déjà enregistrés sont conservés, et non supprimés.

source: In database %@
fr: Dans la base de données %@

source: Keep entries for:
fr: Conservez les entrées pour :
ko: 항목 보관 기간:
tr: Kayıtları saklama süresi:
vi: Giữ mục trong:
zh_hans: 保留记录:
zh_hant: 保留記錄：

source: Runs the claude command line tool so chat bills against your Claude subscription. Database tools need the MCP server turned on in Settings > Integrations.
fr: Exécute l'outil de ligne de commande claude afin de facturer les frais de chat contre votre abonnement Claude. Les outils de base de données nécessitent que le serveur MCP soit activé dans Paramètres > Intégrations.
ko: claude 명령줄 도구를 실행하므로 채팅 사용량은 Claude 구독에 청구됩니다. 데이터베이스 도구를 사용하려면 설정 > 통합에서 MCP 서버를 켜야 합니다.
tr: claude komut satırı aracını çalıştırır, böylece sohbet Claude aboneliğinizden düşer. Veritabanı araçları için Ayarlar > Entegrasyonlar altında MCP sunucusunun açık olması gerekir.
vi: Chạy công cụ dòng lệnh claude nên phần chat sẽ tính vào gói đăng ký Claude của bạn. Các công cụ cơ sở dữ liệu cần bật máy chủ MCP trong Cài đặt > Tích hợp.
zh_hans: 运行 claude 命令行工具，因此聊天会计入你的 Claude 订阅。数据库工具需要在“设置 > 集成”中开启 MCP 服务器。
zh_hant: 執行 claude 命令列工具，因此聊天會計入你的 Claude 訂閱。資料庫工具需要在「設定 > 整合」中開啟 MCP 伺服器。

source: CURRENT_TIMESTAMP()
fr: TIMESTAMP_ACTUELLE()

source: A dump of chosen tables may not restore on its own. Sequences, types, schemas and tables it references are left out.
fr: Un déversement de tables sélectionnées ne peut pas être restauré par lui-même. Les séquences, les types, les schémas et les tables qu'il renvoie sont omises.

source: Closing now stops the run between statements. Statements that already ran stay applied.
fr: La fermeture maintenant arrête la course entre les déclarations. Les déclarations qui ont déjà été exécutées restent appliquées.
ko: 지금 닫으면 구문 사이에서 실행이 중단됩니다. 이미 실행된 구문은 적용된 상태로 남습니다.
tr: Şimdi kapatmak çalıştırmayı ifadeler arasında durdurur. Zaten çalışmış ifadeler uygulanmış kalır.
vi: Đóng bây giờ sẽ dừng lần chạy giữa các câu lệnh. Những câu lệnh đã chạy vẫn được giữ nguyên.
zh_hans: 现在关闭会在语句之间停止运行。已经执行的语句仍保持已应用。
zh_hant: 現在關閉會在陳述式之間停止執行。已經執行的陳述式仍保持已套用。

source: Drop table '%@'
fr: Supprimer la table '%@'
ko: 테이블 '%@' 삭제
tr: Drop tablo '%@'
vi: Xóa bảng '%@'
zh_hans: 删除表 '%@'
zh_hant: 刪除資料表「%@」

source: LSP request was cancelled
fr: La demande LSP a été annulée.
ko: LSP 요청이 취소되었습니다
tr: LSP isteği iptal edildi
vi: Yêu cầu LSP đã bị hủy
zh_hans: LSP 请求已取消
zh_hant: LSP 要求已取消

source: Keep My Changes
fr: Gardez mes modifications
ko: 내 변경 사항 유지
tr: Değişikliklerimi Koru
vi: Giữ thay đổi của tôi
zh_hans: 保留我的更改
zh_hant: 保留我的變更

source: Starting service…
fr: Début du service...
ko: 서비스 시작 중…
tr: Servis başlatılıyor…
vi: Đang khởi động dịch vụ…
zh_hans: 正在启动服务…
zh_hant: 正在啟動服務…

source: The source and the target are the same database. Choose a different target.
fr: La source et la cible sont la même base de données. Choisissez une cible différente.

source: The query did not finish within the configured timeout, so the connection was reset. Run the query again.
fr: La requête n'a pas été terminée dans le délai de temps configuré, donc la connexion a été réinitialisée. Réexécutez la requête.
ko: 쿼리가 설정된 제한 시간 내에 완료되지 않아 연결을 재설정했습니다. 쿼리를 다시 실행하십시오.
tr: Sorgu yapılandırılan zaman aşımı içinde bitmedi, bu yüzden bağlantı sıfırlandı. Sorguyu yeniden çalıştırın.
vi: Truy vấn không hoàn tất trong thời gian chờ đã cấu hình, nên kết nối đã bị đặt lại. Hãy chạy lại truy vấn.
zh_hans: 查询未在配置的超时时间内完成，因此连接已重置。请重新运行该查询。
zh_hant: 查詢未在設定的逾時時間內完成，因此連線已重設。請重新執行該查詢。

source: Copy Details
fr: Copier les détails
ko: 세부사항 복사
tr: Ayrıntıları Kopyala
vi: Sao chép chi tiết
zh_hans: 复制详细信息
zh_hant: 複製詳細資訊

source: As a Read-Only Copy
fr: En tant que copie en lecture seule

source: Conversation history
fr: Historique de la conversation
ko: 대화 기록
tr: Konuşma geçmişi
vi: Lịch sử hội thoại
zh_hans: 对话历史
zh_hant: 對話記錄

source: Whitespace in text
fr: Espace blanc dans le texte
ko: 텍스트의 공백
tr: Metindeki boşluklar
vi: Khoảng trắng trong văn bản
zh_hans: 文本中的空白字符
zh_hant: 文字中的空白字元

source: Last updated
fr: Dernière mise à jour
ko: 마지막 업데이트
tr: Son güncelleme
vi: Cập nhật lần cuối
zh_hans: 最后更新
zh_hant: 最後更新

source: Actual Loops
fr: Boucles réelles
ko: 실제 루프
tr: Gerçek Döngüler
vi: Số vòng lặp thực tế
zh_hans: 实际循环次数
zh_hant: 實際迴圈次數

source: Map
fr: Carte

source: The server chose this row's key.
fr: Le serveur a choisi la clé de cette ligne.
ko: 서버가 이 행의 키를 정했습니다.
tr: Bu satırın anahtarını sunucu seçti.
vi: Máy chủ đã chọn khoá cho dòng này.
zh_hans: 这一行的键由服务器选定。
zh_hant: 這一列的鍵由伺服器選定。

source: Export Query Plan
fr: Plan de requête d'exportation
ko: 쿼리 계획 내보내기
tr: Sorgu Planını Dışa Aktar
vi: Xuất kế hoạch truy vấn
zh_hans: 导出查询计划
zh_hant: 匯出查詢計畫

source: Client key is required when client certificate is set
fr: La clé du client est requise lorsque le certificat client est défini.
ko: 클라이언트 인증서가 설정된 경우 클라이언트 키가 필요합니다
tr: İstemci sertifikası ayarlandığında istemci anahtarı gerekli
vi: Cần khóa client khi đã đặt chứng chỉ client
zh_hans: 设置客户端证书时需要客户端私钥
zh_hant: 設定用戶端憑證時需要用戶端金鑰

source: Default (%d)
fr: Par défaut (%d)

source: Load Extensions
fr: Extensions de chargement

source: Structure and data
fr: Structure et données

source: Object type reported by the engine
fr: Type d'objet signalé par le moteur
ko: 엔진이 보고한 객체 유형
tr: Motorun bildirdiği nesne türü
vi: Kiểu đối tượng do engine báo cáo
zh_hans: 引擎报告的对象类型
zh_hant: 引擎回報的物件類型

source: Will Run
fr: Va courir

source: These changes revoke every privilege from %@, the account this connection uses.
fr: Ces modifications annulent tous les privilèges de %@, le compte utilisé par cette connexion.
ko: 이 변경 사항은 이 연결에서 사용하는 계정 %@의 모든 권한을 취소합니다.
tr: Bu değişiklikler, bu bağlantının kullandığı hesap olan %@ hesabından tüm yetkileri geri alır.
vi: Các thay đổi này thu hồi mọi quyền của %@, tài khoản mà kết nối này đang dùng.
zh_hans: 这些更改会撤销 %@ 的所有权限，也就是此连接使用的账户。
zh_hant: 這些變更會撤銷 %@ 的所有權限，也就是此連線使用的帳號。

source: AI is disabled for this connection.
fr: L'IA est désactivée pour cette connexion.
ko: 이 연결에서는 AI가 비활성화되어 있습니다.
tr: Bu bağlantı için yapay zeka devre dışı.
vi: AI bị tắt cho kết nối này.
zh_hans: 此连接已禁用 AI。
zh_hant: 此連線已停用 AI。

source: Conversation History
fr: Historique de la conversation
ko: 대화 기록
tr: Sohbet Geçmişi
vi: Lịch sử hội thoại
zh_hans: 对话历史
zh_hant: 對話記錄

# Could not connect through the SOCKS proxy at %@:%@. %@
source: Could not connect through the SOCKS proxy at %1$@:%2$@. %3$@
fr: Impossible de se connecter via le proxy SOCKS à %1$@:%2$@. %3$@
ko: %1$@:%2$@의 SOCKS 프록시를 통해 연결할 수 없습니다. %3$@
tr: %1$@:%2$@ adresindeki SOCKS proxy üzerinden bağlanılamadı. %3$@
vi: Không thể kết nối qua SOCKS proxy tại %1$@:%2$@. %3$@
zh_hans: 无法通过 %1$@:%2$@ 的 SOCKS 代理连接。%3$@
zh_hant: 無法透過 %1$@:%2$@ 的 SOCKS 代理連線。%3$@

source: WHERE clause...
fr: Clause WHERE...
ko: WHERE 절...
vi: Mệnh đề WHERE...
zh_hans: WHERE 子句...
zh_hant: WHERE 子句...

source: Delete Session
fr: Supprimer la session

source: Edit Document
fr: Modifier le document

source: Label: %@
fr: Étiquette : %@
ko: 레이블: %@
tr: Etiket: %@
vi: Nhãn: %@
zh_hans: 标签：%@
zh_hant: 標籤：%@

source: Estimated Startup Cost
fr: Coût estimé de démarrage
ko: 예상 시작 비용
tr: Tahmini Başlangıç Maliyeti
vi: Chi phí khởi động ước tính
zh_hans: 估算启动成本
zh_hant: 估算啟動成本

source: Point at the socket file itself, not the directory holding it.
fr: Pointez sur le fichier socket lui-même, et non sur le répertoire qui le contient.
ko: 소켓이 있는 디렉터리가 아니라 소켓 파일 자체를 지정하십시오.
tr: Soket dosyasının kendisini gösterin, onu içeren dizini değil.
vi: Trỏ tới chính tệp socket, không phải thư mục chứa nó.
zh_hans: 请指向 socket 文件本身，而不是它所在的目录。
zh_hant: 請指向 socket 檔案本身，而不是它所在的目錄。

source: Rename Group
fr: Renommer le groupe
ko: 그룹 이름 변경
tr: Grubu Yeniden Adlandır
vi: Đổi tên nhóm
zh_hans: 重命名分组
zh_hant: 重新命名群組

source: %1$d of %2$d listed differences included
fr: %1$d de %2$d des différences répertoriées incluses

source: Error Applying Changes
fr: Erreur lors de l'application des modifications
ko: 변경 사항 적용 오류
tr: Değişiklikler Uygulanırken Hata
vi: Lỗi áp dụng thay đổi
zh_hans: 应用更改时出错
zh_hant: 套用變更時發生錯誤

source: Edit Favorite
fr: Modifier Favoris
ko: 즐겨찾기 편집
tr: Favoriyi Düzenle
vi: Sửa mục yêu thích
zh_hans: 编辑收藏
zh_hant: 編輯我的最愛

source: Open in Agent Mode
fr: Ouvrir en mode agent

source: Keep Running
fr: Continuez à courir
ko: 계속 실행
tr: Çalışmaya Devam Et
vi: Tiếp tục chạy
zh_hans: 继续运行
zh_hant: 繼續執行

source: Drop Database…
fr: Déposer la base de données...
ko: 데이터베이스 삭제…
tr: Veritabanını Sil…
vi: Xóa cơ sở dữ liệu…
zh_hans: 删除数据库…
zh_hant: 捨棄資料庫…

source: Critical
fr: Critique
ko: 심각
tr: Kritik
vi: Quan trọng
zh_hans: 关键
zh_hant: 關鍵

source: Focus Sidebar Filter
fr: Filtre de la barre latérale de mise
ko: 사이드바 필터에 포커스
tr: Sidebar Filtresine Odaklan
vi: Chuyển đến bộ lọc thanh bên
zh_hans: 聚焦侧边栏筛选
zh_hant: 聚焦側邊欄篩選

source: SSH port must be between 1 and 65535
fr: Le port SSH doit être entre 1 et 65535.
ko: SSH 포트는 1~65535 사이여야 합니다
tr: SSH portu 1 ile 65535 arasında olmalıdır
vi: Cổng SSH phải nằm trong khoảng 1 đến 65535
zh_hans: SSH 端口必须在 1 到 65535 之间
zh_hant: SSH 連接埠必須在 1 到 65535 之間

source: How many filters were applied
fr: Combien de filtres ont été appliqués ?
ko: 적용된 필터 수
tr: Kaç filtre uygulandığı
vi: Đã áp dụng bao nhiêu bộ lọc
zh_hans: 应用了多少个筛选条件
zh_hant: 套用了多少個篩選條件

source: Copy Query
fr: Copier la requête
ko: 쿼리 복사
tr: Sorguyu Kopyala
vi: Sao chép truy vấn
zh_hans: 复制查询
zh_hant: 複製查詢

source: History
fr: Histoire
ko: 기록
tr: Geçmiş
vi: Lịch sử
zh_hans: 历史记录
zh_hant: 歷程記錄

source: Green
fr: Vert
ko: 녹색
tr: Yeşil
vi: Xanh lá
zh_hans: 绿色
zh_hant: 綠色

source: Secondary Text
fr: Texte secondaire
ko: 보조 텍스트
tr: İkincil Metin
vi: Văn bản phụ
zh_hans: 次要文本
zh_hant: 次要文字

source: Preparing…
fr: Préparation en cours...

source: Set special value
fr: Définir une valeur spéciale
ko: 특수 값 설정
vi: Đặt giá trị đặc biệt
zh_hans: 设置特殊值
zh_hant: 設定特殊值

source: Reset Columns
fr: Réinitialiser les colonnes
ko: 열 재설정
tr: Sütunları Sıfırla
vi: Đặt lại cột
zh_hans: 重置列
zh_hant: 重設欄位

source: Install plugin from file
fr: Installer le plugin à partir d'un fichier
ko: 파일에서 플러그인 설치
tr: Eklentiyi dosyadan yükle
vi: Cài đặt plugin từ tệp
zh_hans: 从文件安装插件
zh_hant: 從檔案安裝外掛

source: Vim mode: %@
fr: Mode Vim : %@

source: Filter presets
fr: Préréglages de filtres
ko: 필터 프리셋
tr: Filtre ön ayarları
vi: Cài đặt sẵn bộ lọc
zh_hans: 筛选预设
zh_hant: 篩選預設組

source: TablePro takes no funding, sells no data, and has no investors to answer to. Licenses are the whole business model.
fr: TablePro ne reçoit aucun financement, ne vend aucun donnée et n'a pas d'investisseurs à répondre. Les licences sont l'ensemble du modèle économique.
ko: TablePro는 투자를 받지 않고, 데이터를 팔지 않으며, 답해야 할 투자자도 없습니다. 라이선스가 사업 모델의 전부입니다.
tr: TablePro yatırım almaz, veri satmaz ve hesap vereceği yatırımcısı yoktur. İş modelinin tamamı lisanslardır.
vi: TablePro không nhận vốn đầu tư, không bán dữ liệu, và không có nhà đầu tư nào để phải báo cáo. Giấy phép là toàn bộ mô hình kinh doanh.
zh_hans: TablePro 不接受投资，不出售数据，也没有需要交代的投资人。许可证就是全部的商业模式。
zh_hant: TablePro 不接受投資，不出售資料，也沒有需要交代的投資人。授權就是全部的商業模式。

source: Password command timed out after 30 seconds
fr: Le commandement de mot de passe a expiré après 30 secondes.
ko: 암호 명령이 30초 후 시간 초과로 종료되었습니다
tr: Parola komutu 30 saniye sonra zaman aşımına uğradı
vi: Lệnh mật khẩu hết thời gian chờ sau 30 giây
zh_hans: 密码命令在 30 秒后超时
zh_hant: 密碼指令在 30 秒後逾時

source: Run a query to see execution time
fr: Exécutez une requête pour voir le temps d'exécution.
ko: 쿼리를 실행하여 실행 시간 확인
tr: Çalışma süresini görmek için bir sorgu çalıştırın
vi: Chạy truy vấn để xem thời gian thực thi
zh_hans: 运行查询以查看执行时间
zh_hant: 執行查詢以查看執行時間

source: The structure of the tables this query uses is read when the request is sent.
fr: La structure des tables utilisées par cette requête est lu lorsque la demande est envoyée.

source: Loading insights…
fr: Chargement des informations...
ko: 인사이트 불러오는 중…
tr: Analizler yükleniyor…
vi: Đang tải phân tích…
zh_hans: 正在加载分析…
zh_hant: 正在載入分析…

# %@ is already assigned to "%@". Reassigning will remove it from that action.
source: %1$@ is already assigned to "%2$@". Reassigning will remove it from that action.
fr: %1$@ est déjà affecté à "%2$@". La réaffectation le supprimera de cette action.
ko: %1$@ 키는 이미 "%2$@"에 할당되어 있습니다. 다시 할당하면 해당 동작에서 제거됩니다.
tr: %@ is zaten şuna atanmış "%@". Yeniden atama bu işlemden kaldırır.
vi: %1$@ đã được gán cho "%2$@". Gán lại sẽ xóa phím tắt khỏi hành động đó.
zh_hans: %@ 已分配给 "%@"。重新分配将从该操作中移除它。
zh_hant: %1$@ 已指派給「%2$@」。重新指派會將它從該動作中移除。

source: Actual
fr: Réel
ko: 실제
tr: Gerçek
vi: Thực tế
zh_hans: 实际
zh_hant: 實際

source: Attach context
fr: Joindre le contexte
ko: 컨텍스트 첨부
tr: Bağlam ekle
vi: Đính kèm ngữ cảnh
zh_hans: 附加上下文
zh_hant: 附加內容

source: Apply %1$d statements to %2$@?
fr: Appliquer des déclarations %1$d à %2$@?
ko: 구문 %1$d개를 %2$@에 적용하시겠습니까?
tr: %1$d ifade %2$@ üzerine uygulansın mı?
vi: Áp dụng %1$d câu lệnh vào %2$@?
zh_hans: 将 %1$d 条语句应用到 %2$@？
zh_hant: 要將 %1$d 條陳述式套用到 %2$@ 嗎？

source: Open %@ Editor
fr: Ouvrir l'éditeur %@
ko: %@ 편집기 열기
tr: %@ Düzenleyicisini Aç
vi: Mở trình chỉnh sửa %@
zh_hans: 打开 %@ 编辑器
zh_hant: 開啟 %@ 編輯器

source: %lld roles own database objects
fr: %lld rôles possèdent leurs propres objets de base de données
ko: %lld개 역할이 데이터베이스 객체를 소유함
tr: %lld rol veritabanı nesnelerinin sahibi
vi: %lld vai trò đang sở hữu các đối tượng cơ sở dữ liệu
zh_hans: %lld 个角色拥有数据库对象
zh_hant: %lld 個角色擁有資料庫物件

source: Remove tag %@
fr: Supprimer l'étiquette %@
ko: 태그 %@ 제거
tr: %@ etiketini kaldır
vi: Xoá thẻ %@
zh_hans: 移除标签 %@
zh_hant: 移除標籤 %@

source: Color: %@
fr: Couleur : %@
ko: 색상: %@
tr: Renk: %@
vi: Màu: %@
zh_hans: 颜色：%@
zh_hant: 顏色：%@

source: Last 30 days
fr: Derniers 30 jours
ko: 최근 30일
tr: Son 30 gün
vi: 30 ngày qua
zh_hans: 过去 30 天
zh_hant: 過去 30 天

source: Details: %@
fr: Détails : %@
ko: 세부사항: %@
tr: Ayrıntılar: %@
vi: Chi tiết: %@
zh_hans: 详细信息：%@
zh_hant: 詳細資訊：%@

source: Expand
fr: Développer

source: Remove Rule
fr: Supprimer la règle

source: New Table
fr: Nouvelle table
ko: 새 테이블
tr: Yeni Tablo
vi: Bảng mới
zh_hans: 新建表
zh_hant: 新增資料表

source: Query failed: %@
fr: La requête a échoué : %@
ko: 쿼리 실패: %@
tr: Sorgu başarısız: %@
vi: Truy vấn thất bại: %@
zh_hans: 查询失败：%@
zh_hant: 查詢失敗：%@

source: Connect %d Connections
fr: Se connecter à %d connexions
ko: %d개 연결에 접속
tr: %d Bağlantıyı Bağla
vi: Kết nối %d kết nối
zh_hans: 连接%d个连接
zh_hant: 連線 %d 個連線

source: Sign in with ChatGPT
fr: Connectez-vous avec ChatGPT
ko: ChatGPT로 로그인
tr: ChatGPT ile giriş yap
vi: Đăng nhập bằng ChatGPT
zh_hans: 使用 ChatGPT 登录
zh_hant: 使用 ChatGPT 登入

source: AppleScript queries
fr: Requêtes AppleScript

source: Give the server a name.
fr: Donnez un nom au serveur.

source: A new version downloads in the background and installs the next time you quit TablePro.
fr: Une nouvelle version se télécharge en arrière-plan et est installée la prochaine fois que vous quittez TablePro.

source: Table or column names to quote
fr: Noms de table ou de colonne à citer
ko: 인용할 테이블 또는 열 이름
tr: Tırnaklanacak tablo veya sütun adları
vi: Tên bảng hoặc cột cần trích dẫn
zh_hans: 要加引号的表名或列名
zh_hant: 要加引號的資料表或欄位名稱

source: Reload with new properties?
fr: Recharger avec de nouvelles propriétés ?
ko: 새 속성으로 다시 로드하시겠습니까?
tr: Yeni özelliklerle yeniden yüklensin mi?
vi: Tải lại với các thuộc tính mới?
zh_hans: 要用新属性重新加载吗？
zh_hant: 要用新屬性重新載入嗎？

source: What to do with the transaction
fr: Que faire de la transaction ?
ko: 트랜잭션에 대해 수행할 동작
tr: İşlemle ne yapılacağı
vi: Việc cần làm với transaction
zh_hans: 对该事务要做什么
zh_hant: 對該交易要做什麼

source: Status Colors
fr: Couleurs de statut
ko: 상태 색상
tr: Durum Renkleri
vi: Màu trạng thái
zh_hans: 状态颜色
zh_hant: 狀態顏色

source: %@ cannot be scripted with its indexes, because the target's index statements would name a different schema than its definition.
fr: %@ ne peut pas être scripté avec ses index, car les instructions d’index de la cible nommeraient un schéma différent de sa définition.

# %@ (+%d more)
source: %1$@ (+%2$d more)
fr: %1$@ (+%2$d de plus)
ko: %1$@ (+%2$d개 더 있음)
tr: %@ (+%d daha)
vi: %@ (+%d nữa)
zh_hans: %@（另外 %d 个）
zh_hant: %1$@（另外 %2$d 個）
